NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54l15_application_peripherals.h
#define TIMER23_CC_NUM_MIN 0                         /*!< (unspecified)                                                        */
#define TIMER23_CC_NUM_MAX 5                         /*!< (unspecified)                                                        */
#define TIMER23_CC_NUM_SIZE 6                        /*!< (unspecified)                                                        */
#define TIMER23_MAX_SIZE_MIN 0                       /*!< (unspecified)                                                        */
#define TIMER23_MAX_SIZE_MAX 31                      /*!< (unspecified)                                                        */
#define TIMER23_MAX_SIZE_SIZE 32                     /*!< (unspecified)                                                        */
#define TIMER23_PCLK_MHZ 16                          /*!< Peripheral clock frequency (PCLK) is 16 MHz                          */
#define TIMER23_PCLK_VARIABLE 0                      /*!< (unspecified)                                                        */
#define TIMER23_SHUTDOWN_TASK 0                      /*!< (unspecified)                                                        */

#define TIMER24_CC_NUM_MIN 0                         /*!< (unspecified)                                                        */
#define TIMER24_CC_NUM_MAX 5                         /*!< (unspecified)                                                        */
#define TIMER24_CC_NUM_SIZE 6                        /*!< (unspecified)                                                        */
#define TIMER24_MAX_SIZE_MIN 0                       /*!< (unspecified)                                                        */
#define TIMER24_MAX_SIZE_MAX 31                      /*!< (unspecified)                                                        */
#define TIMER24_MAX_SIZE_SIZE 32                     /*!< (unspecified)                                                        */
#define TIMER24_PCLK_MHZ 16                          /*!< Peripheral clock frequency (PCLK) is 16 MHz                          */
#define TIMER24_PCLK_VARIABLE 0                      /*!< (unspecified)                                                        */
#define TIMER24_SHUTDOWN_TASK 0                      /*!< (unspecified)                                                        */

/*Event generator unit*/
#define EGU_PRESENT 1
#define EGU_COUNT 2

#define EGU10_PEND 0                                 /*!< (unspecified)                                                        */
#define EGU10_CH_NUM_MIN 0                           /*!< (unspecified)                                                        */
#define EGU10_CH_NUM_MAX 15                          /*!< (unspecified)                                                        */
#define EGU10_CH_NUM_SIZE 16                         /*!< (unspecified)                                                        */

#define EGU20_PEND 0                                 /*!< (unspecified)                                                        */
#define EGU20_CH_NUM_MIN 0                           /*!< (unspecified)                                                        */
#define EGU20_CH_NUM_MAX 5                           /*!< (unspecified)                                                        */
#define EGU20_CH_NUM_SIZE 6                          /*!< (unspecified)                                                        */

/*2.4 GHz radio*/
#define RADIO_PRESENT 1
#define RADIO_COUNT 1

#define RADIO_IRQ_COUNT 2
#define RADIO_WHITENINGPOLY 1                        /*!< (unspecified)                                                        */
#define RADIO_IEEE802154 1                           /*!< (unspecified)                                                        */
#define RADIO_LONGRANGE 1                            /*!< (unspecified)                                                        */
#define RADIO_DIRECTIONFINDING 1                     /*!< (unspecified)                                                        */
#define RADIO_CHANNELSOUNDING 1                      /*!< (unspecified)                                                        */
#define RADIO_ADPLLCOMPANION_INCLUDE_DMA 0           /*!< (unspecified)                                                        */

/*I2C compatible Two-Wire Master Interface with EasyDMA*/
#define TWIM_PRESENT 1
#define TWIM_COUNT 4

#define TWIM20_HAS_INTPEND 0                         /*!< (unspecified)                                                        */
#define TWIM20_EASYDMA_MAXCNT_MIN 0                  /*!< (unspecified)                                                        */
#define TWIM20_EASYDMA_MAXCNT_MAX 15                 /*!< (unspecified)                                                        */
#define TWIM20_EASYDMA_MAXCNT_SIZE 16                /*!< (unspecified)                                                        */
#define TWIM20_CORE_FREQUENCY 16                     /*!< Peripheral clock frequency is 16 MHz.                                */
#define TWIM20_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 0 /*!< (unspecified)                                                   */

#define TWIM21_HAS_INTPEND 0                         /*!< (unspecified)                                                        */
#define TWIM21_EASYDMA_MAXCNT_MIN 0                  /*!< (unspecified)                                                        */
#define TWIM21_EASYDMA_MAXCNT_MAX 15                 /*!< (unspecified)                                                        */
#define TWIM21_EASYDMA_MAXCNT_SIZE 16                /*!< (unspecified)                                                        */
#define TWIM21_CORE_FREQUENCY 16                     /*!< Peripheral clock frequency is 16 MHz.                                */
#define TWIM21_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 0 /*!< (unspecified)                                                   */

#define TWIM22_HAS_INTPEND 0                         /*!< (unspecified)                                                        */
#define TWIM22_EASYDMA_MAXCNT_MIN 0                  /*!< (unspecified)                                                        */
#define TWIM22_EASYDMA_MAXCNT_MAX 15                 /*!< (unspecified)                                                        */
#define TWIM22_EASYDMA_MAXCNT_SIZE 16                /*!< (unspecified)                                                        */
#define TWIM22_CORE_FREQUENCY 16                     /*!< Peripheral clock frequency is 16 MHz.                                */
#define TWIM22_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 0 /*!< (unspecified)                                                   */

#define TWIM30_HAS_INTPEND 0                         /*!< (unspecified)                                                        */
#define TWIM30_EASYDMA_MAXCNT_MIN 0                  /*!< (unspecified)                                                        */
#define TWIM30_EASYDMA_MAXCNT_MAX 15                 /*!< (unspecified)                                                        */
#define TWIM30_EASYDMA_MAXCNT_SIZE 16                /*!< (unspecified)                                                        */
#define TWIM30_CORE_FREQUENCY 16                     /*!< Peripheral clock frequency is 16 MHz.                                */
#define TWIM30_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 0 /*!< (unspecified)                                                   */

/*I2C compatible Two-Wire Slave Interface with EasyDMA*/
#define TWIS_PRESENT 1
#define TWIS_COUNT 4

#define TWIS20_EASYDMA_MAXCNT_MIN 0                  /*!< (unspecified)                                                        */
#define TWIS20_EASYDMA_MAXCNT_MAX 15                 /*!< (unspecified)                                                        */
#define TWIS20_EASYDMA_MAXCNT_SIZE 16                /*!< (unspecified)                                                        */
#define TWIS20_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 0 /*!< (unspecified)                                                   */

#define TWIS21_EASYDMA_MAXCNT_MIN 0                  /*!< (unspecified)                                                        */
#define TWIS21_EASYDMA_MAXCNT_MAX 15                 /*!< (unspecified)                                                        */
#define TWIS21_EASYDMA_MAXCNT_SIZE 16                /*!< (unspecified)                                                        */
#define TWIS21_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 0 /*!< (unspecified)                                                   */

#define TWIS22_EASYDMA_MAXCNT_MIN 0                  /*!< (unspecified)                                                        */
#define TWIS22_EASYDMA_MAXCNT_MAX 15                 /*!< (unspecified)                                                        */
#define TWIS22_EASYDMA_MAXCNT_SIZE 16                /*!< (unspecified)                                                        */
#define TWIS22_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 0 /*!< (unspecified)                                                   */

#define TWIS30_EASYDMA_MAXCNT_MIN 0                  /*!< (unspecified)                                                        */
#define TWIS30_EASYDMA_MAXCNT_MAX 15                 /*!< (unspecified)                                                        */
#define TWIS30_EASYDMA_MAXCNT_SIZE 16                /*!< (unspecified)                                                        */
#define TWIS30_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 0 /*!< (unspecified)                                                   */

/*Memory configuration*/
#define MEMCONF_PRESENT 1
#define MEMCONF_COUNT 1

#define MEMCONF_RETTRIM 1                            /*!< (unspecified)                                                        */
#define MEMCONF_REPAIR 0                             /*!< (unspecified)                                                        */
#define MEMCONF_REPAIR_DUAL 0                        /*!< (unspecified)                                                        */
#define MEMCONF_POWER 1                              /*!< (unspecified)                                                        */

/*Pulse Density Modulation (Digital Microphone) Interface*/
#define PDM_PRESENT 1
#define PDM_COUNT 2

